USE PV_319_DDL;
--INSERT Groups
--		(group_id,group_name,direction)
--	--VALUES 
--	--		(1,		N'PU_211',		1),
--	--		(2,		N'PV_211',		1),
--	--		(3,		N'PD_212',		1),
--	--		(4,		N'SU_321',		1),
--	--		(5,		N'DU_123',		1),
--	--		(6,		N'DD_311',		1),
--	--		(7,		N'PD_321',		1),
--	--		(8,		N'Java_326',	1),
--	--		(9,		N'PU_212',		1),
--	--		(10,	N'PV_212',		1)
--	--		;
INSERT Disciplines
			(discipline_id,discipline_name,number_of_lessons)
			VALUES 
				(1,N'Процедурное программирование на языке C++',70),
				(2,N'Объектно-ориентированное программирование на языке C++',60),
				(3,N'UML и паттерны проектирования',18),
				(4,N'Язык программирования C#',32),
				(5,N'Разработка Windows приложений на языке C++',18),
				(6,N'Разработка Windows приложений на языке C#',18),
				(8,N'Теория баз данных и программирование MS SQL Server',24	),
				(9,N'Сетевое программирование',24),
				(10,N'Системное программирование',24),
				(11,N'Управление программными проектами',18),
				(12,N'Технология доступа к данным ADO.NET',18),
				(13,N'Разработка Web-приложений с использованием технологии ASP.NET',18	),
				(14,N'Основы программирования на языке Java',96),
				(15,N'HTML/CSS',18),
				(16,N'JavaScript',24),
				(17,N'Теория баз данных программирование MySQL Server',24),
				(18,N'Язык программирования PHP',24),
				(19,N'Технология NodeJS',18	),
				(20,N'Технология ReactJS',18),
				(21,N'Photoshop',24),
				(22,N'Illustrator',24),
				(23,N'AutoCAD',24),
				(24,N'3DS Max',36),
				(25,N'Maya',44),
				(26,N'Blender',24),
				(28,N'Базовые технологии локальных сетей',24),
				(30,N'Маршрутизация в IP-сетях',32),
				(31,N'Протоколы прикладного уровня',32),
				(33,N'Семейство протоколов IPv6',24),
				(34,N'Hardware-PC',48),
				(35,N'Администрирование Windows',48	),
				(36,N'Администрирование Windows Server',32),
				(37,N'Администрирование UNIX',64)